// 1 - устанавливаем npm instal -g typescript
// 2 -
// 3
// 4
// 5
// 6
// 7
// 8
// 9
// 2 - создаем файл тс
// 3- пишешь для проверки console.log(3)
// 4- вводишь в терминале команду tsc app.ts
// 5- далее команда node app.js
// 6- чтобы запустить проект заходим в концигурацию, нажимаем +, выбираем нода, далее выбираем файл js и все работает
// 7- переменным можно завать типизацию let age:number = 22; let age:string = 22; let age:null = 22 и тд
// 8- let age:any = 22; any это костыль и лучше не использовать, может быть любой тип но тогда тс превращается в джс и нет смысла в нем
// 9- let age:string | number = 22;  - або если хотим несколько типав данных передать
// 10- каждый раз когда меняем что то в файле ts нужно в терминале прописывать tsc app.ts

   // Классы
// 11- є три типа модифікаторів доступу:
//      - private  - самий захищений модифікатор який видно тілько в середині класу
//      - протектор - видко в класах і в нащадках
//      - паблік - видно всюди
// 12-  void - ничего не возвращает только переприсваивает
// если не указывать ничего то автоматически будет паблик
// 13-
// 14-
// 15-
// 16-
// 17-
// 18-
// 19-

